Core/src/InformationRegisters/УчетнаяПолитикаРегл/УчетнаяПолитикаРегл.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитикаРегл</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <resources>
    <name>СчетНезавершенноеПроизводство</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетПоложительнаяКурсоваяРазницаДеньги</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетОтрицательнаяКурсоваяРазницаДеньги</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетПоложительнаяКурсоваяРазницаЗадолженность</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетОтрицательнаяКурсоваяРазницаЗадолженность</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>РозничныйКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорРозничногоКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяДДСРозничныхПродаж</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </resources>
  <resources>
    <name>СчетПрочихДоходов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетПрочихРасходов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетПрибыльУбытки</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетДеньгиВПути</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетПоложительнаяКурсоваяРазницаКонвертация</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетОтрицательнаяКурсоваяРазницаКонвертация</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратБезвозмезднойПродажи</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратНДСБезвозмезднойПродажи</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаНалогаНаПрибыль</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаНалогаНаПрибыльПодлежащийОплате</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаИмпортРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаИмпортВозвратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетТранзитногоСклада</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>ВидНадогаДляСчетовНДС</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратБезвозмезднойПродажиСотрудник</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратНДСБезвозмезднойПродажиСотрудник</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратНДФЛСотрудник</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратПФСотрудник</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратВозврат</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаСвободнаяпродажа</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаСвободнаяпродажаСотрудник</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/УчетнаяПолитикаРегл/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Запись.Период) Тогда
	
		Запись.Период = ТекущаяДата();
	
	КонецЕсли; 
	
	НаборДвижений = РегистрыСведений.НеПереоцениватьСчета.СоздатьНаборЗаписей();
	НаборДвижений.Прочитать();
	НеПереоцениватьСчета.Загрузить(НаборДвижений.Выгрузить());
	
	НаборДвижений = РегистрыСведений.СчетаФинансовогоРезультатаДоходы.СоздатьНаборЗаписей();
	НаборДвижений.Прочитать();
	СчетаФинансовогоРезультатаДоходы.Загрузить(НаборДвижений.Выгрузить());
	
	НаборДвижений = РегистрыСведений.СчетаФинансовогоРезультатаРасходы.СоздатьНаборЗаписей();
	НаборДвижений.Прочитать();
	СчетаФинансовогоРезультатаРасходы.Загрузить(НаборДвижений.Выгрузить());
	
	НаборДвижений = РегистрыСведений.СчетаКосвенныхПроизводственныхЗатрат.СоздатьНаборЗаписей();
	НаборДвижений.Прочитать();
	СчетаКосвенныхЗатрат.Загрузить(НаборДвижений.Выгрузить());
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСчетаПоУмолчанию()
	
	Запись.СчетНезавершенноеПроизводство = ПланыСчетов.Хозрасчетный.НайтиПоКоду("1630");
	
	Запись.СчетПоложительнаяКурсоваяРазницаДеньги = ПланыСчетов.Хозрасчетный.НайтиПоКоду("8140/1");
	Запись.СчетОтрицательнаяКурсоваяРазницаДеньги = ПланыСчетов.Хозрасчетный.НайтиПоКоду("8240/1");
	
	Запись.СчетПоложительнаяКурсоваяРазницаЗадолженность = ПланыСчетов.Хозрасчетный.НайтиПоКоду("8140/2");
	Запись.СчетОтрицательнаяКурсоваяРазницаЗадолженность = ПланыСчетов.Хозрасчетный.НайтиПоКоду("8240/2");
	Запись.СчетДеньгиВПути = ПланыСчетов.Хозрасчетный.НайтиПоКоду("2015");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПоУмолчанию(Команда)
	ЗаполнитьСчетаПоУмолчанию();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	НаборДвижений = РегистрыСведений.НеПереоцениватьСчета.СоздатьНаборЗаписей();
	НаборДвижений.Загрузить(НеПереоцениватьСчета.Выгрузить());
	НаборДвижений.Записать(Истина);
	
	НаборДвижений = РегистрыСведений.СчетаФинансовогоРезультатаДоходы.СоздатьНаборЗаписей();
	НаборДвижений.Загрузить(СчетаФинансовогоРезультатаДоходы.Выгрузить());
	НаборДвижений.Записать(Истина);
	
	НаборДвижений = РегистрыСведений.СчетаФинансовогоРезультатаРасходы.СоздатьНаборЗаписей();
	НаборДвижений.Загрузить(СчетаФинансовогоРезультатаРасходы.Выгрузить());
	НаборДвижений.Записать(Истина);
	
	НаборДвижений = РегистрыСведений.СчетаКосвенныхПроизводственныхЗатрат.СоздатьНаборЗаписей();
	НаборДвижений.Загрузить(СчетаКосвенныхЗатрат.Выгрузить());
	НаборДвижений.Записать(Истина);
	
КонецПроцедуры
